Reports/СопоставлениеПоПоставщикам_ПроверкаРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>СопоставлениеПоПоставщикам_ПроверкаРезервов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеБух</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетБух</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГУИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаНачалоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаКонецДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаОборотДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаОборотКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаНачалоКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухСуммаКонецКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентНаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаФинансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетФин</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаНачалоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаНачалоКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаОборотДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаОборотКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаКонецДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинСуммаКонецКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентНаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГУИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СопоставлениеПоПоставщикам_ПроверкаРезервов/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;	
	
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Бух();
	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Бух() + ".COMConnector");
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключиться к базе бухгалтерии!");
		Возврат;
	КонецПопытки;	
		
	Запрос=v82.NewObject("Запрос");
	
	ЗапросДанныеФинансов = Новый Запрос;
	
	ИсключитьВнутренниеОбороты = Истина;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	
	Для каждого Параметр из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если СокрЛП(Параметр.Параметр)="ПериодОтчета" Тогда
			
			Запрос.УстановитьПараметр("НачалоПериода",Параметр.Значение.ДатаНачала);
			Запрос.УстановитьПараметр("КонецПериода",КонецДня(Параметр.Значение.ДатаОкончания));
			
			ЗапросДанныеФинансов.УстановитьПараметр("НачалоПериода",Параметр.Значение.ДатаНачала);
			ЗапросДанныеФинансов.УстановитьПараметр("КонецПериода",КонецДня(Параметр.Значение.ДатаОкончания));			
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "ИсключитьВнутренниеОбороты" Тогда
			
			ИсключитьВнутренниеОбороты = Параметр.Значение;	
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "Организация" Тогда	
			
			Запрос.УстановитьПараметр("Организация", v82.Справочники.Организации.НайтиПоРеквизиту("ИНН", Параметр.Значение.ИНН));
			ЗапросДанныеФинансов.УстановитьПараметр("Организация", Параметр.Значение);
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "СписокСчетовФин" Тогда
			
			ЗапросДанныеФинансов.УстановитьПараметр("СписокСчетов", Параметр.Значение);
			
		ИначеЕсли СокрЛП(Параметр.Параметр) = "СписокСчетовБух" Тогда
			
			СписокСчетовБух = v82.NewObject("Массив");
			
			Для Каждого ЭлСписка Из Параметр.Значение Цикл
				НайдСчет = v82.ПланыСчетов.Хозрасчетный.НайтиПоКоду(ЭлСписка.Значение.Код);
				
				Если НЕ НайдСчет = v82.ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
					СписокСчетовБух.Добавить(НайдСчет);
				КонецЕсли;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовБух);		
		
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИсключитьВнутренниеОбороты", ИсключитьВнутренниеОбороты);
	ЗапросДанныеФинансов.УстановитьПараметр("ИсключитьВнутренниеОбороты", ИсключитьВнутренниеОбороты);
	
	ТаблицаФинансы.Очистить();
	ДанныеБух.Очистить();	
	  
	ЗапросДанныеФинансов.Текст = "ВЫБРАТЬ
	                             |	ФинансовыйОстатки.Счет,
	                             |	ФинансовыйОстатки.Субконто2 КАК Контрагент,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет.Код = ""60.Р""
	                             |			ТОГДА ФинансовыйОстатки.СуммаМСФОНачальныйОстатокДт
	                             |		ИНАЧЕ ФинансовыйОстатки.СуммаНачальныйОстатокДт
	                             |	КОНЕЦ КАК НачальныйОстатокДт,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет.Код = ""60.Р""
	                             |			ТОГДА ФинансовыйОстатки.СуммаМСФОНачальныйОстатокКт
	                             |		ИНАЧЕ ФинансовыйОстатки.СуммаНачальныйОстатокКт
	                             |	КОНЕЦ КАК НачальныйОстатокКт,
	                             |	0 КАК ОборотДт,
	                             |	0 КАК ОборотКт,
	                             |	0 КАК КонечныйОстатокДт,
	                             |	0 КАК КонечныйОстатокКт,
	                             |	ФинансовыйОстатки.Организация
	                             |ПОМЕСТИТЬ СводнаяТаблица
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация) КАК ФинансовыйОстатки
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	ФинансовыйОбороты.Счет,
	                             |	ФинансовыйОбороты.Субконто2,
	                             |	0,
	                             |	0,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОбороты.Счет.Код = ""60.Р""
	                             |			ТОГДА ФинансовыйОбороты.СуммаМСФООборотДт
	                             |		ИНАЧЕ ФинансовыйОбороты.СуммаОборотДт
	                             |	КОНЕЦ,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОбороты.Счет.Код = ""60.Р""
	                             |			ТОГДА ФинансовыйОбороты.СуммаМСФООборотКт
	                             |		ИНАЧЕ ФинансовыйОбороты.СуммаОборотКт
	                             |	КОНЕЦ,
	                             |	0,
	                             |	0,
	                             |	ФинансовыйОбороты.Организация
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация, , ) КАК ФинансовыйОбороты
	                             |
	                             |ОБЪЕДИНИТЬ ВСЕ
	                             |
	                             |ВЫБРАТЬ
	                             |	ФинансовыйОстатки.Счет,
	                             |	ФинансовыйОстатки.Субконто2,
	                             |	0,
	                             |	0,
	                             |	0,
	                             |	0,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет.Код = ""60.Р""
	                             |			ТОГДА ФинансовыйОстатки.СуммаМСФОКонечныйОстатокДт
	                             |		ИНАЧЕ ФинансовыйОстатки.СуммаКонечныйОстатокДт
	                             |	КОНЕЦ,
	                             |	ВЫБОР
	                             |		КОГДА ФинансовыйОстатки.Счет.Код = ""60.Р""
	                             |			ТОГДА ФинансовыйОстатки.СуммаМСФОКонечныйОстатокКт
	                             |		ИНАЧЕ ФинансовыйОстатки.СуммаКонечныйОстатокКт
	                             |	КОНЕЦ,
	                             |	ФинансовыйОстатки.Организация
	                             |ИЗ
	                             |	РегистрБухгалтерии.Финансовый.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация) КАК ФинансовыйОстатки
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	СводнаяТаблица.Счет КАК СчетФин,
	                             |	СводнаяТаблица.Контрагент КАК Контрагент,
	                             |	СУММА(СводнаяТаблица.НачальныйОстатокДт) КАК ФинСуммаНачалоДт,
	                             |	СУММА(СводнаяТаблица.НачальныйОстатокКт) КАК ФинСуммаНачалоКт,
	                             |	СУММА(СводнаяТаблица.ОборотДт) КАК ФинСуммаОборотДт,
	                             |	СУММА(СводнаяТаблица.ОборотКт) КАК ФинСуммаОборотКт,
	                             |	СУММА(СводнаяТаблица.КонечныйОстатокДт) КАК ФинСуммаКонецДт,
	                             |	СУММА(СводнаяТаблица.КонечныйОстатокКт) КАК ФинСуммаКонецКт,
	                             |	СводнаяТаблица.Организация
	                             |ИЗ
	                             |	СводнаяТаблица КАК СводнаяТаблица
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	                             |		ПО СводнаяТаблица.Контрагент.ИНН = Организации.ИНН
	                             |ГДЕ
	                             |	ВЫБОР
	                             |			КОГДА &ИсключитьВнутренниеОбороты И СводнаяТаблица.Контрагент.ИНН <> """"
	                             |				ТОГДА Организации.Ссылка ЕСТЬ NULL	                             
	                             |			ИНАЧЕ ИСТИНА
	                             |		КОНЕЦ
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	СводнаяТаблица.Счет,
	                             |	СводнаяТаблица.Контрагент,
	                             |	СводнаяТаблица.Организация";
								 	
	ТаблицаФинансыВрем = ЗапросДанныеФинансов.Выполнить().Выгрузить();	
	
	Для Каждого Стр Из ТаблицаФинансыВрем Цикл
		НовСтр = ТаблицаФинансы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);		
		НовСтр.КонтрагентНаименованиеПолное = ?(Стр.Контрагент = Неопределено, "", СокрЛП(Стр.Контрагент.НаименованиеПолное));
		НовСтр.КонтрагентНаименование = ?(Стр.Контрагент = Неопределено, "", СокрЛП(Стр.Контрагент.Наименование));
		НовСтр.КонтрагентИНН = ?(Стр.Контрагент = Неопределено, "", Стр.Контрагент.Инн);
		НовСтр.ГУИД = ?(Стр.Контрагент = Неопределено, "", Строка(Стр.Контрагент.УникальныйИдентификатор()));
	КонецЦикла;	
	
	ТекстЗапроса="ВЫБРАТЬ
			|	ФинансовыйОстатки.Счет,
			|	ФинансовыйОстатки.Субконто1 КАК Контрагент,
			|	ФинансовыйОстатки.СуммаНачальныйОстатокДт КАК НачальныйОстатокДт,
			|	ФинансовыйОстатки.СуммаНачальныйОстатокКт КАК НачальныйОстатокКт,
			|	0 КАК ОборотДт,
			|	0 КАК ОборотКт,
			|	0 КАК КонечныйОстатокДт,
			|	0 КАК КонечныйОстатокКт,
			|	ФинансовыйОстатки.Организация
			|ПОМЕСТИТЬ СводнаяТаблица
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация) КАК ФинансовыйОстатки

			|ОБЪЕДИНИТЬ ВСЕ

			|ВЫБРАТЬ
			|	ФинансовыйОбороты.Счет,
			|	ФинансовыйОбороты.Субконто1,
			|	0,
			|	0,
			|	ФинансовыйОбороты.СуммаОборотДт,
			|	ФинансовыйОбороты.СуммаОборотКт,
			|	0,
			|	0,
			|	ФинансовыйОбороты.Организация
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация, , ) КАК ФинансовыйОбороты

			|ОБЪЕДИНИТЬ ВСЕ

			|ВЫБРАТЬ
			|	ФинансовыйОстатки.Счет,
			|	ФинансовыйОстатки.Субконто1,
			|	0,
			|	0,
			|	0,
			|	0,
			|	ФинансовыйОстатки.СуммаКонечныйОстатокДт,
			|	ФинансовыйОстатки.СуммаКонечныйОстатокКт,
			|	ФинансовыйОстатки.Организация
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация) КАК ФинансовыйОстатки
			|;

			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СводнаяТаблица.Счет.Код КАК СчетБух,
			|	СводнаяТаблица.Контрагент,
			|	СУММА(СводнаяТаблица.НачальныйОстатокДт) КАК БухСуммаНачалоДт,
			|	СУММА(СводнаяТаблица.НачальныйОстатокКт) КАК БухСуммаНачалоКт,
			|	СУММА(СводнаяТаблица.ОборотДт) КАК БухСуммаОборотДт,
			|	СУММА(СводнаяТаблица.ОборотКт) КАК БухСуммаОборотКт,
			|	СУММА(СводнаяТаблица.КонечныйОстатокДт) КАК БухСуммаКонецДт,
			|	СУММА(СводнаяТаблица.КонечныйОстатокКт) КАК БухСуммаКонецКт,
			|	СводнаяТаблица.Организация.ИНН КАК ОрганизацияИНН
			|ИЗ
			|	СводнаяТаблица КАК СводнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО СводнаяТаблица.Контрагент.ИНН = Организации.ИНН
 			|ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ИсключитьВнутренниеОбороты И СводнаяТаблица.Контрагент.ИНН <> """"
	        |				ТОГДА Организации.Ссылка ЕСТЬ NULL 
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
			|СГРУППИРОВАТЬ ПО
			|	СводнаяТаблица.Счет,
			|	СводнаяТаблица.Контрагент,
			|	СводнаяТаблица.Счет.Код,
			|	СводнаяТаблица.Организация.ИНН";
	
	Запрос.Текст=ТекстЗапроса;
	
	Выборка=Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		НС=ДанныеБух.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.Контрагент = СокрЛП(Выборка.Контрагент.Наименование);
		НС.КонтрагентНаименованиеПолное = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
		НС.КонтрагентИНН = Выборка.Контрагент.ИНН;
		НС.ГУИД =  v82.XMLСтрока(Выборка.Контрагент);
		НС.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", СокрЛП(Выборка.ОрганизацияИНН));
		НС.Обработан = Ложь;
		
	КонецЦикла;	
	
		
	СводнаяТаблица = Новый ТаблицаЗначений;	
	СводнаяТаблица.Колонки.Добавить("Контрагент");
	СводнаяТаблица.Колонки.Добавить("Организация");
	СводнаяТаблица.Колонки.Добавить("СчетФин");
	СводнаяТаблица.Колонки.Добавить("СчетБух");
	СводнаяТаблица.Колонки.Добавить("БухСуммаНачалоДт");
	СводнаяТаблица.Колонки.Добавить("БухСуммаНачалоКт");
	СводнаяТаблица.Колонки.Добавить("БухСуммаКонецДт");	
	СводнаяТаблица.Колонки.Добавить("БухСуммаКонецКт");
	СводнаяТаблица.Колонки.Добавить("БухСуммаОборотДт");	
	СводнаяТаблица.Колонки.Добавить("БухСуммаОборотКт");	
	//
	СводнаяТаблица.Колонки.Добавить("ФинСуммаНачалоДт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаНачалоКт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаКонецДт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаКонецКт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаОборотДт");
	СводнаяТаблица.Колонки.Добавить("ФинСуммаОборотКт");
	
	НайдСтр = Неопределено;
	
	ТЗСоот = Новый ТаблицаЗначений;
	ТЗСоот.Колонки.Добавить("КонтрагентСсылка");
	ТЗСоот.Колонки.Добавить("НайдСтр");
	
	Для Каждого Стр Из ТаблицаФинансы Цикл		
				
		//Если СокрЛП(Стр.Контрагент)= "Розничный покупатель" Тогда
		//	Сообщить("РП");
		//КонецЕсли;
		
		НовСтр = СводнаяТаблица.Добавить();
		
		НовСтр.БухСуммаНачалоДт = 0;
		НовСтр.БухСуммаНачалоКт = 0;
		НовСтр.БухСуммаКонецДт = 0;
		НовСтр.БухСуммаКонецКт = 0;
		НовСтр.БухСуммаОборотДт = 0;
		НовСтр.БухСуммаОборотКт = 0;
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		//поиск контрагента из бух		
		НайдСтр = Неопределено;	
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Обработан", Ложь);
		
		//1. Гуид
		СтруктураПоиска.Вставить("ГУИД", Стр.Гуид);
		
		НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
		
		//2. ИНН
		Если НайдСтроки.Количество() = 0 Тогда
			СтруктураПоиска.Удалить("Гуид");
			Если ЗначениеЗаполнено(Стр.КонтрагентИНН) И Стр.КонтрагентИНН <> "000000000000" Тогда
				СтруктураПоиска.Вставить("КонтрагентИНН", Стр.КонтрагентИНН);
				
				НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//3. Наименование полное
		Если НайдСтроки.Количество() = 0 Тогда
			СтруктураПоиска.Удалить("КонтрагентИНН");
			СтруктураПоиска.Вставить("КонтрагентНаименованиеПолное", Стр.КонтрагентНаименованиеПолное);
			
			НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
			
		КонецЕсли;	
		
		//4. Наименование
		Если НайдСтроки.Количество() = 0 Тогда
			СтруктураПоиска.Удалить("КонтрагентНаименованиеПолное");
			СтруктураПоиска.Вставить("Контрагент", Стр.КонтрагентНаименование);
			
			НайдСтроки = ДанныеБух.НайтиСтроки(СтруктураПоиска);
			
		КонецЕсли;
		
		НайдСтр = Неопределено;
		
		Если НайдСтроки.Количество() Тогда
		 	НайдСтр = НайдСтроки[0];
		КонецЕсли;
		
		ПолученоИзТаблицы = Ложь;
		
		Если НайдСтр <> Неопределено Тогда
			
			НовСтрСоот = ТЗСоот.Добавить();
			НовСтрСоот.КонтрагентСсылка = Стр.Контрагент;
			НовСтрСоот.НайдСтр = НайдСтр;
			
		КонецЕсли;
		
		Если НайдСтр = Неопределено Тогда
			тмпСтр = ТзСоот.Найти(Стр.Контрагент, "КонтрагентСсылка");
			
			Если тмпСтр <> Неопределено Тогда
				НайдСтр = тмпСтр.НайдСтр;
				ПолученоИзТаблицы = Истина;
			КонецЕсли;
		КонецЕсли;
				
		Если НайдСтр <> Неопределено Тогда		
			
				НовСтр.СчетБух = НайдСтр.СчетБух;
				
				Если НЕ ПолученоИзТаблицы Тогда
					НовСтр.БухСуммаНачалоДт = НайдСтр.БухСуммаНачалоДт;
					НовСтр.БухСуммаНачалоКт = НайдСтр.БухСуммаНачалоКт;
					НовСтр.БухСуммаКонецДт = НайдСтр.БухСуммаКонецДт;
					НовСтр.БухСуммаКонецКт = НайдСтр.БухСуммаКонецКт;
					НовСтр.БухСуммаОборотДт = НайдСтр.БухСуммаОборотДт;
					НовСтр.БухСуммаОборотКт = НайдСтр.БухСуммаОборотКт;
				Иначе
					НовСтр.БухСуммаНачалоДт = 0;
					НовСтр.БухСуммаНачалоКт = 0;
					НовСтр.БухСуммаКонецДт = 0;
					НовСтр.БухСуммаКонецКт = 0;
					НовСтр.БухСуммаОборотДт = 0;
					НовСтр.БухСуммаОборотКт = 0;
				КонецЕсли;			
				
				НайдСтр.Обработан = Истина;			
			
		КонецЕсли;
			
		//Если СокрЛП(Стр.Контрагент)= "Розничный покупатель" Тогда
		//	Сообщить(НовСтр.Контрагент);
		//КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого Стр Из ДанныеБух Цикл
		
		Если НЕ Стр.Обработан Тогда
			НовСтр = СводнаяТаблица.Добавить();
			ЗаполнитьЗначениясвойств(НовСтр, Стр);
			
			
			//1. Гуид
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ГУИД", Стр.Гуид);
		
			НайдСтроки = ТаблицаФинансы.НайтиСтроки(СтруктураПоиска);
		
			//2. ИНН
			Если НайдСтроки.Количество() = 0 Тогда
				СтруктураПоиска.Удалить("Гуид");
				Если ЗначениеЗаполнено(Стр.КонтрагентИНН) И Стр.КонтрагентИНН <> "000000000000" Тогда
					СтруктураПоиска.Вставить("КонтрагентИНН", Стр.КонтрагентИНН);
				
					НайдСтроки = ТаблицаФинансы.НайтиСтроки(СтруктураПоиска);
				
			КонецЕсли;
			
			КонецЕсли;
		
			//3. Наименование полное
			Если НайдСтроки.Количество() = 0 Тогда
				СтруктураПоиска.Удалить("КонтрагентИНН");
				СтруктураПоиска.Вставить("КонтрагентНаименованиеПолное", Стр.КонтрагентНаименованиеПолное);
			
				НайдСтроки = ТаблицаФинансы.НайтиСтроки(СтруктураПоиска);
			
			КонецЕсли;
			
			Если НайдСтроки.Количество() <> 0 Тогда
				НовСтр.Контрагент = НайдСтроки[0].Контрагент;
			КонецЕсли;
			
			//
			НовСтр.СчетФин = "";
			НовСтр.ФинСуммаНачалоДт = 0;
			НовСтр.ФинСуммаНачалоКт = 0;
			НовСтр.ФинСуммаКонецДт = 0;
			НовСтр.ФинСуммаКонецКт = 0;
			НовСтр.ФинСуммаОборотДт = 0;
			НовСтр.ФинСуммаОборотКт = 0;			
			
		КонецЕсли;
		
	КонецЦикла;		
		
	//Из схемы возьмем настройки по умолчанию
	Настройки = КомпоновщикНастроек.Настройки;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
											Настройки, ДанныеРасшифровки);

	ВнешниеНаборыДанных=Новый Структура;

	ВнешниеНаборыДанных.Вставить("СводнаяТаблица",СводнаяТаблица);										
											
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,
													   ДанныеРасшифровки);

	//Очищаем поле табличного документа

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры
